html/kotlin/collections/aggregate.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>聚合操作</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Wu, Shanliang" />
<link rel="stylesheet" type="text/css" href="../css/main.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./sort.html"> UP </a>
 |
 <a accesskey="H" href="./collections.html"> HOME </a>
</div><div id="content">
<h1 class="title">聚合操作</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org150f7c7">Fold 与 reduce</a></li>
</ul>
</div>
</div>
<p>
Kotlin 集合包含用于常用的 聚合操作 （基于集合内容返回单个值的操作）的函数：
</p>
<ul class="org-ul">
<li><span class="underline">minOrNull()</span> 与 <span class="underline">maxOrNull()</span> 分别返回最小和最大的元素</li>
<li><span class="underline">average()</span> 返回数字集合中元素的平均值</li>
<li><span class="underline">sum()</span> 返回数字集合中元素的总和</li>
<li><span class="underline">count()</span> 返回集合中元素的数量</li>
</ul>

<div class="org-src-container">
<pre class="src src-kotlin"><span style="color: #00bfff; font-weight: bold;">fun</span> <span style="color: #daa520; font-weight: bold;">main</span>() {
<span style="color: #5f9ea0; font-style: italic;">//</span><span style="color: #5f9ea0; font-style: italic;">sampleStart</span>
    <span style="color: #00bfff; font-weight: bold;">val</span> <span style="color: #4eee94;">numbers</span> = listOf(6, 42, 10, 4)

    println(<span style="color: #deb887;">"Count: ${</span>numbers.count()<span style="color: #deb887;">}"</span>)
    println(<span style="color: #deb887;">"Max: ${</span>numbers.maxOrNull()<span style="color: #deb887;">}"</span>)
    println(<span style="color: #deb887;">"Min: ${</span>numbers.minOrNull()<span style="color: #deb887;">}"</span>)
    println(<span style="color: #deb887;">"Average: ${</span>numbers.average()<span style="color: #deb887;">}"</span>)
    println(<span style="color: #deb887;">"Sum: ${</span>numbers.sum()<span style="color: #deb887;">}"</span>)
<span style="color: #5f9ea0; font-style: italic;">//</span><span style="color: #5f9ea0; font-style: italic;">sampleEnd</span>
}
</pre>
</div>

<p>
还有一些通过某些选择器函数或自定义 Comparator 来检索最小和最大元素的函数。
</p>
<ul class="org-ul">
<li><span class="underline">maxByOrNull()</span> / <span class="underline">minByOrNull()</span>  接受一个 <span class="underline">选择器函数</span> 并返回使选择器返回最大或最小值的元素</li>
<li><span class="underline">maxWithOrNull()</span> / <span class="underline">minWithOrNull()</span> 接受一个 <span class="underline">Comparator 对象</span> 并且根据此 Comparator 对象返回最大或最小元素</li>
</ul>

<div class="org-src-container">
<pre class="src src-kotlin"><span style="color: #00bfff; font-weight: bold;">fun</span> <span style="color: #daa520; font-weight: bold;">main</span>() {
<span style="color: #5f9ea0; font-style: italic;">//</span><span style="color: #5f9ea0; font-style: italic;">sampleStart</span>
    <span style="color: #00bfff; font-weight: bold;">val</span> <span style="color: #4eee94;">numbers2</span> = listOf(5, 42, 10, 4)
    <span style="color: #00bfff; font-weight: bold;">val</span> <span style="color: #4eee94;">min3Remainder</span> = numbers2.minByOrNull { <span style="color: #00bfff; font-weight: bold;">it</span> % 3 }
    println(min3Remainder)

    <span style="color: #00bfff; font-weight: bold;">val</span> <span style="color: #4eee94;">strings</span> = listOf(<span style="color: #deb887;">"one"</span>, <span style="color: #deb887;">"two"</span>, <span style="color: #deb887;">"three"</span>, <span style="color: #deb887;">"four"</span>)
    <span style="color: #00bfff; font-weight: bold;">val</span> <span style="color: #4eee94;">longestString</span> = strings.maxWithOrNull(compareBy { <span style="color: #00bfff; font-weight: bold;">it</span>.length })
    println(longestString)
<span style="color: #5f9ea0; font-style: italic;">//</span><span style="color: #5f9ea0; font-style: italic;">sampleEnd</span>
}
</pre>
</div>
<div id="outline-container-org150f7c7" class="outline-2">
<h2 id="org150f7c7">Fold 与 reduce</h2>
<div class="outline-text-2" id="text-org150f7c7">
<p>
对于更特定的情况，有函数 <span class="underline">reduce()</span> 和 <span class="underline">fold()</span> ，它们依次将所提供的操作应用于集合元素并返回累积的结果。 操作有两个参数：先前的累积值和集合元素。这两个函数的区别在于：
</p>
<ul class="org-ul">
<li>fold() 接受一个 <span class="underline">初始值</span> 并将其用作第一步的累积值</li>
<li>reduce() 的第一步则将 <span class="underline">第一个</span> 和 <span class="underline">第二个元素</span> 作为第一步的操作参数</li>
</ul>

<div class="org-src-container">
<pre class="src src-kotlin"><span style="color: #00bfff; font-weight: bold;">fun</span> <span style="color: #daa520; font-weight: bold;">main</span>() {
<span style="color: #5f9ea0; font-style: italic;">//</span><span style="color: #5f9ea0; font-style: italic;">sampleStart</span>
    <span style="color: #00bfff; font-weight: bold;">val</span> <span style="color: #4eee94;">numbers</span> = listOf(5, 2, 10, 4)

    <span style="color: #00bfff; font-weight: bold;">val</span> <span style="color: #4eee94;">sum</span> = numbers.reduce { sum, element -&gt; sum + element }
    println(sum)
    <span style="color: #00bfff; font-weight: bold;">val</span> <span style="color: #4eee94;">sumDoubled</span> = numbers.fold(0) { sum, element -&gt; sum + element * 2 }
    println(sumDoubled)

    <span style="color: #5f9ea0; font-style: italic;">//</span><span style="color: #5f9ea0; font-style: italic;">val </span><span style="color: #4eee94;">sumDoubledReduce</span><span style="color: #5f9ea0; font-style: italic;"> = numbers.reduce { sum, element -&gt; sum + element * 2 } //&#38169;&#35823;&#65306;&#31532;&#19968;&#20010;&#20803;&#32032;&#22312;&#32467;&#26524;&#20013;&#27809;&#26377;&#21152;&#20493;</span>
    <span style="color: #5f9ea0; font-style: italic;">//</span><span style="color: #5f9ea0; font-style: italic;">println(sumDoubledReduce)</span>
<span style="color: #5f9ea0; font-style: italic;">//</span><span style="color: #5f9ea0; font-style: italic;">sampleEnd</span>
}
</pre>
</div>

<pre class="example">
    上面的实例展示了区别：fold() 用于计算加倍的元素之和

    如果将相同的函数传给 reduce()，那么它会返回另一个结果，因为在第一步中它将列表的第一个和第二个元素作为参数，所以第一个元素不会被加倍
</pre>

<p>
如需将函数以 <span class="underline">相反的顺序</span> 应用于元素，可以使用函数 <span class="underline">reduceRight()</span> 和 <span class="underline">foldRight()</span> 它们的工作方式类似于 fold() 和 reduce()，但从最后一个元素开始，然后再继续到前一个元素
</p>


<div class="org-src-container">
<pre class="src src-kotlin"><span style="color: #00bfff; font-weight: bold;">fun</span> <span style="color: #daa520; font-weight: bold;">main</span>() {
<span style="color: #5f9ea0; font-style: italic;">//</span><span style="color: #5f9ea0; font-style: italic;">sampleStart</span>
    <span style="color: #00bfff; font-weight: bold;">val</span> <span style="color: #4eee94;">numbers</span> = listOf(5, 2, 10, 4)
    <span style="color: #00bfff; font-weight: bold;">val</span> <span style="color: #4eee94;">sumDoubledRight</span> = numbers.foldRight(0) { element, sum -&gt; sum + element * 2 }
    println(sumDoubledRight)
<span style="color: #5f9ea0; font-style: italic;">//</span><span style="color: #5f9ea0; font-style: italic;">sampleEnd</span>
}
</pre>
</div>

<pre class="example">
    记住，在使用 foldRight 或 reduceRight 时，操作参数会更改其顺序：第一个参数变为元素，然后第二个参数变为累积值
</pre>

<p>
还可以使用将 <span class="underline">元素索引</span> 作为参数的操作。 为此，使用函数 <span class="underline">reduceIndexed()</span> 和 <span class="underline">foldIndexed()</span> 传递元素索引作为操作的第一个参数。最后，还有将这些操作从右到左应用于集合元素的函数 <span class="underline">reduceRightIndexed()</span> 与 <span class="underline">foldRightIndexed()</span> 
</p>

<div class="org-src-container">
<pre class="src src-kotlin"><span style="color: #00bfff; font-weight: bold;">fun</span> <span style="color: #daa520; font-weight: bold;">main</span>() {
    <span style="color: #5f9ea0; font-style: italic;">//</span><span style="color: #5f9ea0; font-style: italic;">sampleStart</span>
    <span style="color: #00bfff; font-weight: bold;">val</span> <span style="color: #4eee94;">numbers</span> = listOf(5, 2, 10, 4)
    <span style="color: #00bfff; font-weight: bold;">val</span> <span style="color: #4eee94;">sumEven</span> = numbers.foldIndexed(0) { idx, sum, element -&gt; <span style="color: #00bfff; font-weight: bold;">if</span> (idx % 2 == 0) sum + element <span style="color: #00bfff; font-weight: bold;">else</span> sum }
    println(sumEven)

    <span style="color: #00bfff; font-weight: bold;">val</span> <span style="color: #4eee94;">sumEvenRight</span> = numbers.foldRightIndexed(0) { idx, element, sum -&gt; <span style="color: #00bfff; font-weight: bold;">if</span> (idx % 2 == 0) sum + element <span style="color: #00bfff; font-weight: bold;">else</span> sum }
    println(sumEvenRight)
    <span style="color: #5f9ea0; font-style: italic;">//</span><span style="color: #5f9ea0; font-style: italic;">sampleEnd</span>
}
</pre>
</div>

<table border="1" cellspacing="0" cellpadding="6" rules="all" frame="boader">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><a href="write.html">Next：更改</a></td>
<td class="org-left"><a href="sort.html">Previous：排序</a></td>
<td class="org-left"><a href="collections.html">Home：集合</a></td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="postamble" class="status">

		  <br/>
		  <div class='ds-thread'></div>
		  <script>
		  var duoshuoQuery = {short_name:'klose911'};
		  (function() {
					  var dsThread = document.getElementsByClassName('ds-thread')[0];
					  dsThread.setAttribute('data-thread-key', document.title);
					  dsThread.setAttribute('data-title', document.title);
					  dsThread.setAttribute('data-url', window.location.href);
					  var ds = document.createElement('script');
					  ds.type = 'text/javascript';ds.async = true;
					  ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
					  ds.charset = 'UTF-8';
					  (document.getElementsByTagName('head')[0] 
						|| document.getElementsByTagName('body')[0]).appendChild(ds);
					  })();
		  </script>
		  <script>
		  (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
			(i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
			m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
			})(window,document,'script','https://www.google-analytics.com/analytics.js','ga');
		  ga('create', 'UA-90850421-1', 'auto');
		  ga('send', 'pageview');
		  </script>
</div>
</body>
</html>
